Revit 2027 API
BuiltInFailures.DimensionFailures.RegenConstraintUnsatisfiedWarn Property
 Constraints are not satisfied
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RegenConstraintUnsatisfiedWarn { get; }
Public Shared ReadOnly Property RegenConstraintUnsatisfiedWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RegenConstraintUnsatisfiedWarn {
	FailureDefinitionId^ get ();
}
static member RegenConstraintUnsatisfiedWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace